Revit 2027 API
BuiltInFailures.AutoRouteFailures.FittingParamsCauseGeometryToFailWarning Property
 The one of parameters for the fitting is causing the geometry to fail.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FittingParamsCauseGeometryToFailWarning { get; }
Public Shared ReadOnly Property FittingParamsCauseGeometryToFailWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FittingParamsCauseGeometryToFailWarning {
	FailureDefinitionId^ get ();
}
static member FittingParamsCauseGeometryToFailWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace